app/serializers/schedule_serializer.rb

  def self.format_schedule_with_user_shows(schedule,user)
    {
    schedule: {
        id: schedule.id,
        title: schedule.title,
        date: schedule.date,
        created_at: schedule.created_at,
        updated_at: schedule.updated_at
      },
      shows: schedule.shows.map do |show|
---
SELECT "shows".* FROM "shows" INNER JOIN "schedule_shows" ON "shows"."id" = "schedule_shows"."show_id" WHERE "schedule_shows"."schedule_id" = $1  [["schedule_id", 1]]