app/controllers/api/v1/schedules_controller.rb

SELECT "schedules".* FROM "schedules"
---
  def index
    schedules = Schedule.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "schedules".* FROM "schedules" INNER JOIN "schedules_users" ON "schedules"."id" = "schedules_users"."schedule_id" WHERE "schedules_users"."user_id" = $1 AND "schedules"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."user_id" = $1 AND "schedules"."id" = $2 LIMIT $3  [["user_id", 3], ["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    user = User.find(params[:user_id])
    schedule = user.schedules.find(params[:id])

    render json: {
      schedule: schedule,
      shows: schedule.shows,
      user: {
        id: user.id,
        first_name: user.first_name,
        last_name: user.last_name

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "schedules".* FROM "schedules" WHERE "schedules"."user_id" = $1 AND "schedules"."id" = $2 LIMIT $3  [["user_id", 8], ["id", 1], ["LIMIT", 1]]
SELECT "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "schedule_shows".* FROM "schedule_shows" WHERE "schedule_shows"."schedule_id" = $1 AND "schedule_shows"."show_id" = $2 LIMIT $3  [["schedule_id", 1], ["show_id", 10], ["LIMIT", 1]]
DELETE FROM "schedule_shows" WHERE "schedule_shows"."id" = $1  [["id", 2]]
---
  def destroy
    user = User.find(params[:user_id])
    schedule = user.schedules.find_by(id: params[:schedule_id])
    if schedule.nil?
      render json: ErrorSerializer.format_errors('Schedule not found'), status: :not_found
      return
    end

    show = Show.find_by(id: params[:show_id])
    if show.nil?
      render json:ErrorSerializer.format_errors('Show not found'), status: :not_found
      return
    end

    schedule_show = schedule.schedule_shows.find_by(show_id: show.id)

    if schedule_show
      schedule_show.destroy