app/controllers/api/v1/schedules_controller.rb

  def show
    user = User.find(params[:user_id])
    schedule = user.schedules.find(params[:id])

    render json: {
    schedule: schedule,
    shows: schedule.shows,
    user: {
      id: schedule.user.id,
      first_name: schedule.user.first_name,
      last_name: schedule.user.last_name
---
SELECT "shows".* FROM "shows" INNER JOIN "schedule_shows" ON "shows"."id" = "schedule_shows"."show_id" WHERE "schedule_shows"."schedule_id" = $1  [["schedule_id", 1]]